awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
/**
 * @file qspi_init.c
 * QUADSPI memory-mapped (XIP) init for Micron MT25TL01G — Bank 1, 64 MB.
 *
 * Adapted from STM32CubeH7 QSPI_MemoryMappedDual example for early boot init.
 * 
 * STM32H750B-DK dual-QSPI pin assignment (from UM2488 / board schematic):
 *   Signal   Pin   AF
 *   CLK      PF10  AF9
 *   NCS      PG6   AF10
 *   BK1_IO0  PD11  AF9
 *   BK1_IO1  PF9   AF10
 *   BK1_IO2  PF7   AF9
 *   BK1_IO3  PF6   AF9
 *   BK2_IO0  PH2   AF9
 *   BK2_IO1  PH3   AF9
 *   BK2_IO2  PG9   AF9
 *   BK2_IO3  PG14  AF9
 *
 * Read mode: Quad-Output Fast Read (0x6B) — 1-line inst, 1-line 32-bit addr,
 * 8 dummy cycles, 4-line data.  Clock = AHB3 (200 MHz) / (1+1) = 100 MHz.
 */

#include "qspi_init.h"
#include "main.h"       /* Error_Handler() */
#include "app_log.h"
#include "stm32h7xx_hal.h"
#include <string.h>

/* ---- MT25TL01G command set (Micron, SPI-NOR compatible) ------------------- */
#define MT25_RESET_ENABLE_CMD         0x66U
#define MT25_RESET_MEM_CMD            0x99U
#define MT25_WRITE_ENABLE_CMD         0x06U
#define MT25_READ_STATUS_CMD          0x05U
#define MT25_READ_FLAG_STATUS_CMD     0x70U
#define MT25_ENTER_4BYTE_ADDR_CMD     0xB7U
#define MT25_READ_VOL_CFG_REG_CMD     0x85U  /* Volatile Config Register */
#define MT25_WRITE_VOL_CFG_REG_CMD    0x81U
#define MT25_READ_DATA_CMD            0x03U
#define MT25_SUBSECTOR_ERASE_CMD      0x20U
#define MT25_PAGE_PROGRAM_CMD         0x02U
#define MT25_QUAD_OUT_FAST_READ       0x6BU  /* 1-1-4: inst/addr on SIO0, data on 4 lines */
#define MT25_DUMMY_CYCLES             8U

/*
 * Single die = 64 MB = 2^26 bytes -> FlashSize field 25.
 * Dual-flash interleaved window = 128 MB = 2^27 bytes -> FlashSize field 26.
 */
#define MT25_FLASH_SIZE_FIELD_SINGLE  25U
#define MT25_FLASH_SIZE_FIELD_DUAL    26U
#define QSPI_CLOCK_PRESCALER          3U   /* 200 MHz / 4 = 50 MHz */
#define QSPI_KERNEL_CLOCK_HZ          200000000U

/* Volatile config register dummy cycles field (bits 7:4 for quad read) */
#define QSPI_VCR_DUMMY_CYCLES_MASK    0xF0U
#define QSPI_VCR_DUMMY_QUAD_SHIFT     4U

/* Destructive self-test region near top of 64MB bank to avoid app assets. */
#define QSPI_SELFTEST_ENABLE          1U
#define QSPI_SELFTEST_ADDR            0x03F00000U
#define QSPI_SELFTEST_SIZE            4096U
#define QSPI_PAGE_SIZE                256U
#define QSPI_RAMTEST_WORDS            512U
#define QSPI_SOAK_TEST_MS             1000U

typedef struct
{
    uint8_t prescaler;
    uint32_t sample_shifting;
    uint32_t cs_high_time;
    uint8_t dummy_cycles;
} QSPI_TuneConfig;

/* Handle is file-scope; no public API needed beyond the init function. */
static QSPI_HandleTypeDef hqspi;

static void QSPI_WriteEnable(void);
static void QSPI_WaitReady(void);
static void QSPI_DummyCyclesCfg(uint8_t dummy_cycles);
static void QSPI_SetFlashTarget(uint32_t flash_id, uint32_t dualflash);
static void QSPI_DumpQspiRegs(const char *tag);
static void QSPI_DumpCoreRegs(const char *tag);
static void QSPI_DumpFlashRegs(const char *tag);
static void QSPI_DumpMmWindow(const char *tag);
static int QSPI_TryReadRegs(uint8_t instruction, uint8_t *buf, uint8_t len);
static int QSPI_RunSelfTestAtCurrentSpeed(uint8_t dummy_cycles, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100);
static int QSPI_RunSelfTestForMs(uint8_t dummy_cycles, uint32_t duration_ms, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100);

static uint32_t qspi_ramtest_buf[QSPI_RAMTEST_WORDS];

/* ---- Helpers -------------------------------------------------------------- */

static void QSPI_GPIO_Init(void)
{
    GPIO_InitTypeDef g = {0};

    /* Peripheral + GPIO clocks */
    __HAL_RCC_QSPI_CLK_ENABLE();
    __HAL_RCC_QSPI_FORCE_RESET();
    __HAL_RCC_QSPI_RELEASE_RESET();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();

    g.Mode  = GPIO_MODE_AF_PP;
    g.Pull  = GPIO_NOPULL;
    g.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

    /* CLK: PF10, AF9 */
    g.Pin = GPIO_PIN_10; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

    /* NCS: PG6, AF10 — pull-up keeps flash deselected when idle */
    g.Pin = GPIO_PIN_6; g.Pull = GPIO_PULLUP; g.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init(GPIOG, &g);
    g.Pull = GPIO_NOPULL;

    /* IO0: PD11, AF9 */
    g.Pin = GPIO_PIN_11; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOD, &g);

    /* IO1: PF9, AF10 */
    g.Pin = GPIO_PIN_9; g.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

    /* IO2: PF7, AF9 */
    g.Pin = GPIO_PIN_7; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

    /* BK1 IO3: PF6, AF9 */
    g.Pin = GPIO_PIN_6; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

    /* BK2 IO0: PH2, AF9 */
    g.Pin = GPIO_PIN_2; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOH, &g);

    /* BK2 IO1: PH3, AF9 */
    g.Pin = GPIO_PIN_3; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOH, &g);

    /* BK2 IO2: PG9, AF9 */
    g.Pin = GPIO_PIN_9; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOG, &g);

    /* BK2 IO3: PG14, AF9 */
    g.Pin = GPIO_PIN_14; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOG, &g);
}

static void QSPI_SendCmd(uint8_t instruction)
{
    QSPI_CommandTypeDef cmd = {0};
    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_NONE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

static uint8_t QSPI_ReadReg(uint8_t instruction)
{
    QSPI_CommandTypeDef cmd = {0};
    uint8_t reg = 0U;

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = 1U;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Receive(&hqspi, &reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    return reg;
}

static void __attribute__((unused)) QSPI_ReadRegs(uint8_t instruction, uint8_t *buf, uint8_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    if (len == 0U || buf == NULL) {
        return;
    }

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Receive(&hqspi, buf, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

