awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
static int QSPI_TryReadRegs(uint8_t instruction, uint8_t *buf, uint8_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    if (len == 0U || buf == NULL) {
        return 0;
    }

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return 0;
    }
    if (HAL_QSPI_Receive(&hqspi, buf, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return 0;
    }
    return 1;
}

static void QSPI_LogRegs(const char *tag)
{
    uint8_t sr = QSPI_ReadReg(MT25_READ_STATUS_CMD);
    uint8_t vcr = QSPI_ReadReg(MT25_READ_VOL_CFG_REG_CMD);
    APP_LOGI("QSPI", "%s SR=0x%02x (WIP=%u WEL=%u) VCR=0x%02x",
             tag,
             (unsigned)sr,
             (unsigned)(sr & 0x01U),
             (unsigned)((sr >> 1) & 0x01U),
             (unsigned)vcr);
}

static void QSPI_DumpQspiRegs(const char *tag)
{
    APP_LOGI("QDBG", "%s QUADSPI CR=0x%08lx DCR=0x%08lx SR=0x%08lx FCR=0x%08lx",
             tag,
             (unsigned long)QUADSPI->CR,
             (unsigned long)QUADSPI->DCR,
             (unsigned long)QUADSPI->SR,
             (unsigned long)QUADSPI->FCR);
    APP_LOGI("QDBG", "%s QUADSPI DLR=0x%08lx CCR=0x%08lx AR=0x%08lx ABR=0x%08lx",
             tag,
             (unsigned long)QUADSPI->DLR,
             (unsigned long)QUADSPI->CCR,
             (unsigned long)QUADSPI->AR,
             (unsigned long)QUADSPI->ABR);
    APP_LOGI("QDBG", "%s QUADSPI PSMKR=0x%08lx PSMAR=0x%08lx PIR=0x%08lx LPTR=0x%08lx",
             tag,
             (unsigned long)QUADSPI->PSMKR,
             (unsigned long)QUADSPI->PSMAR,
             (unsigned long)QUADSPI->PIR,
             (unsigned long)QUADSPI->LPTR);
}

static void QSPI_DumpCoreRegs(const char *tag)
{
    APP_LOGI("QDBG", "%s SCB CCR=0x%08lx SHCSR=0x%08lx CFSR=0x%08lx HFSR=0x%08lx",
             tag,
             (unsigned long)SCB->CCR,
             (unsigned long)SCB->SHCSR,
             (unsigned long)SCB->CFSR,
             (unsigned long)SCB->HFSR);
    APP_LOGI("QDBG", "%s SCB BFAR=0x%08lx MMFAR=0x%08lx DFSR=0x%08lx AFSR=0x%08lx VTOR=0x%08lx",
             tag,
             (unsigned long)SCB->BFAR,
             (unsigned long)SCB->MMFAR,
             (unsigned long)SCB->DFSR,
             (unsigned long)SCB->AFSR,
             (unsigned long)SCB->VTOR);
}

static void QSPI_DumpFlashRegs(const char *tag)
{
    uint8_t sr[2] = {0U, 0U};
    uint8_t fsr[2] = {0U, 0U};
    uint8_t vcr[2] = {0U, 0U};
    uint8_t n = (hqspi.Init.DualFlash == QSPI_DUALFLASH_ENABLE) ? 2U : 1U;

    if (!QSPI_TryReadRegs(MT25_READ_STATUS_CMD, sr, n) ||
        !QSPI_TryReadRegs(MT25_READ_FLAG_STATUS_CMD, fsr, n) ||
        !QSPI_TryReadRegs(MT25_READ_VOL_CFG_REG_CMD, vcr, n)) {
        APP_LOGI("QDBG", "%s FLASH reg read failed (non-fatal)", tag);
        return;
    }

    if (n == 2U) {
        APP_LOGI("QDBG", "%s FLASH SR=[%02x %02x] FSR=[%02x %02x] VCR=[%02x %02x]",
                 tag,
                 (unsigned)sr[0], (unsigned)sr[1],
                 (unsigned)fsr[0], (unsigned)fsr[1],
                 (unsigned)vcr[0], (unsigned)vcr[1]);
    } else {
        APP_LOGI("QDBG", "%s FLASH SR=0x%02x FSR=0x%02x VCR=0x%02x",
                 tag,
                 (unsigned)sr[0],
                 (unsigned)fsr[0],
                 (unsigned)vcr[0]);
    }
}

static void QSPI_DumpMmWindow(const char *tag)
{
    volatile uint8_t *p8 = (volatile uint8_t *)0x90000000U;
    volatile uint32_t *p32 = (volatile uint32_t *)0x90000000U;

    APP_LOGI("QDBG", "%s MM8  [0..15]=%02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x",
             tag,
             (unsigned)p8[0], (unsigned)p8[1], (unsigned)p8[2], (unsigned)p8[3],
             (unsigned)p8[4], (unsigned)p8[5], (unsigned)p8[6], (unsigned)p8[7],
             (unsigned)p8[8], (unsigned)p8[9], (unsigned)p8[10], (unsigned)p8[11],
             (unsigned)p8[12], (unsigned)p8[13], (unsigned)p8[14], (unsigned)p8[15]);
    APP_LOGI("QDBG", "%s MM32 [0..3]=%08lx %08lx %08lx %08lx",
             tag,
             (unsigned long)p32[0],
             (unsigned long)p32[1],
             (unsigned long)p32[2],
             (unsigned long)p32[3]);
}

static uint32_t QSPI_CyclesPerSecond(void)
{
    uint32_t hz = SystemCoreClock;
    return (hz == 0U) ? 400000000U : hz;
}

static uint32_t QSPI_MBs_x100(uint32_t bytes, uint32_t cycles)
{
    uint64_t num;
    uint64_t den;

    if (cycles == 0U) {
        return 0U;
    }

    num = (uint64_t)bytes * (uint64_t)QSPI_CyclesPerSecond() * 100ULL;
    den = (uint64_t)cycles * 1024ULL * 1024ULL;
    return (uint32_t)(num / den);
}

static void QSPI_EnableMemoryMappedRead(uint8_t dummy_cycles)
{
    QSPI_CommandTypeDef cmd = {0};
    QSPI_MemoryMappedTypeDef mmap = {0};

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_QUAD_OUT_FAST_READ;
    cmd.AddressMode       = QSPI_ADDRESS_1_LINE;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_4_LINES;
    cmd.DummyCycles       = dummy_cycles;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    mmap.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;

    if (HAL_QSPI_MemoryMapped(&hqspi, &cmd, &mmap) != HAL_OK) {
        Error_Handler();
    }
}

static void QSPI_DisableMemoryMappedRead(void)
{
    if (HAL_QSPI_Abort(&hqspi) != HAL_OK) {
        Error_Handler();
    }
}

static uint32_t QSPI_FreqMHz(uint32_t prescaler)
{
    return (QSPI_KERNEL_CLOCK_HZ / (prescaler + 1U)) / 1000000U;
}

static int QSPI_RunClassicRamTests(void)
{
    static const uint32_t patterns[] = {
        0x00000000U,
        0xFFFFFFFFU,
        0xAAAAAAAAU,
        0x55555555U,
        0x33333333U,
        0xCCCCCCCCU
    };
    uint32_t i;
    uint32_t p;

