awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
    APP_LOGI("RAM", "classic test start words=%lu", (unsigned long)QSPI_RAMTEST_WORDS);

    for (p = 0; p < (sizeof(patterns) / sizeof(patterns[0])); p++) {
        uint32_t pat = patterns[p];
        for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
            qspi_ramtest_buf[i] = pat;
        }
        for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
            if (qspi_ramtest_buf[i] != pat) {
                APP_LOGI("RAM", "pattern FAIL pat=0x%08lx idx=%lu got=0x%08lx",
                         (unsigned long)pat,
                         (unsigned long)i,
                         (unsigned long)qspi_ramtest_buf[i]);
                return 0;
            }
        }
    }

    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        qspi_ramtest_buf[i] = (1UL << (i & 31U));
    }
    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        uint32_t exp = (1UL << (i & 31U));
        if (qspi_ramtest_buf[i] != exp) {
            APP_LOGI("RAM", "walk1 FAIL idx=%lu exp=0x%08lx got=0x%08lx",
                     (unsigned long)i,
                     (unsigned long)exp,
                     (unsigned long)qspi_ramtest_buf[i]);
            return 0;
        }
    }

    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        qspi_ramtest_buf[i] = ~(1UL << (i & 31U));
    }
    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        uint32_t exp = ~(1UL << (i & 31U));
        if (qspi_ramtest_buf[i] != exp) {
            APP_LOGI("RAM", "walk0 FAIL idx=%lu exp=0x%08lx got=0x%08lx",
                     (unsigned long)i,
                     (unsigned long)exp,
                     (unsigned long)qspi_ramtest_buf[i]);
            return 0;
        }
    }

    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        qspi_ramtest_buf[i] = ((i * 0x9E3779B1U) ^ 0xA5A5A5A5U);
    }
    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        uint32_t exp = ((i * 0x9E3779B1U) ^ 0xA5A5A5A5U);
        if (qspi_ramtest_buf[i] != exp) {
            APP_LOGI("RAM", "addr/data FAIL idx=%lu exp=0x%08lx got=0x%08lx",
                     (unsigned long)i,
                     (unsigned long)exp,
                     (unsigned long)qspi_ramtest_buf[i]);
            return 0;
        }
    }

    APP_LOGI("RAM", "classic test PASS");
    return 1;
}

static void QSPI_InitPeripheral(const QSPI_TuneConfig *cfg)
{
    hqspi.Instance                = QUADSPI;
    hqspi.Init.ClockPrescaler     = cfg->prescaler;
    hqspi.Init.FifoThreshold      = 1U;
    hqspi.Init.SampleShifting     = cfg->sample_shifting;
    hqspi.Init.FlashSize          = MT25_FLASH_SIZE_FIELD_DUAL;
    hqspi.Init.ChipSelectHighTime = cfg->cs_high_time;
    hqspi.Init.ClockMode          = QSPI_CLOCK_MODE_0;
    hqspi.Init.FlashID            = QSPI_FLASH_ID_2;
    hqspi.Init.DualFlash          = QSPI_DUALFLASH_ENABLE;  /* STM32H750B-DK has dual QSPI NOR */

    HAL_QSPI_DeInit(&hqspi);
    if (HAL_QSPI_Init(&hqspi) != HAL_OK) {
        Error_Handler();
    }
}

static void QSPI_SetFlashTarget(uint32_t flash_id, uint32_t dualflash)
{
    hqspi.Init.FlashID = flash_id;
    hqspi.Init.DualFlash = dualflash;
    hqspi.Init.FlashSize = (dualflash == QSPI_DUALFLASH_ENABLE)
                           ? MT25_FLASH_SIZE_FIELD_DUAL
                           : MT25_FLASH_SIZE_FIELD_SINGLE;

    HAL_QSPI_DeInit(&hqspi);
    if (HAL_QSPI_Init(&hqspi) != HAL_OK) {
        /* Some stacks reject FLASH_ID_2 when DualFlash is enabled; retry FLASH_ID_1. */
        if ((dualflash == QSPI_DUALFLASH_ENABLE) && (flash_id == QSPI_FLASH_ID_2)) {
            APP_LOGI("QSPI", "dual init with FlashID=2 failed, retry FlashID=1");
            hqspi.Init.FlashID = QSPI_FLASH_ID_1;
            HAL_QSPI_DeInit(&hqspi);
            if (HAL_QSPI_Init(&hqspi) != HAL_OK) {
                Error_Handler();
            }
        } else {
            Error_Handler();
        }
    }

    APP_LOGI("QSPI", "target flash=%lu dual=%lu fsize=%lu",
             (unsigned long)hqspi.Init.FlashID,
             (unsigned long)hqspi.Init.DualFlash,
             (unsigned long)hqspi.Init.FlashSize);
}

static int QSPI_ConfigFlashForMemoryMapped(const QSPI_TuneConfig *cfg)
{
    /* ST QSPI_MemoryMappedDual sequence: keep dual enabled and configure once. */
    QSPI_SetFlashTarget(QSPI_FLASH_ID_2, QSPI_DUALFLASH_ENABLE);

    QSPI_SendCmd(MT25_RESET_ENABLE_CMD);
    QSPI_SendCmd(MT25_RESET_MEM_CMD);
    QSPI_WaitReady();

    QSPI_WriteEnable();
    QSPI_SendCmd(MT25_ENTER_4BYTE_ADDR_CMD);
    QSPI_WaitReady();

    QSPI_DummyCyclesCfg(cfg->dummy_cycles);
    return 1;
}

static void QSPI_Erase4K(uint32_t address)
{
    QSPI_CommandTypeDef cmd = {0};

    QSPI_WriteEnable();

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_SUBSECTOR_ERASE_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_1_LINE;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.Address           = address;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_NONE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

    QSPI_WaitReady();
}

static void QSPI_ProgramPage(uint32_t address, const uint8_t *data, uint32_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    QSPI_WriteEnable();

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_PAGE_PROGRAM_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_1_LINE;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.Address           = address;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Transmit(&hqspi, (uint8_t *)data, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

