awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
    QSPI_WaitReady();
}

static void QSPI_ReadData(uint32_t address, uint8_t *data, uint32_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_READ_DATA_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_1_LINE;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.Address           = address;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Receive(&hqspi, data, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

static int QSPI_RunSelfTestAtCurrentSpeed(uint8_t dummy_cycles, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100)
{
    static uint8_t tx[QSPI_SELFTEST_SIZE];
    static uint8_t rx[QSPI_SELFTEST_SIZE];
    uint32_t erase_cycles;
    uint32_t write_cycles;
    uint32_t read_cycles;
    uint32_t mm_read_cycles;
    uint32_t t0;
    uint32_t i;

    APP_LOGI("QSPI", "selftest start addr=0x%08lx size=%lu",
             (unsigned long)QSPI_SELFTEST_ADDR,
             (unsigned long)QSPI_SELFTEST_SIZE);

    for (i = 0; i < QSPI_SELFTEST_SIZE; i++) {
        tx[i] = (uint8_t)((i * 37U) ^ 0xA5U);
        rx[i] = 0U;
    }

    t0 = DWT->CYCCNT;
    QSPI_Erase4K(QSPI_SELFTEST_ADDR);
    erase_cycles = DWT->CYCCNT - t0;

    t0 = DWT->CYCCNT;
    for (i = 0; i < QSPI_SELFTEST_SIZE; i += QSPI_PAGE_SIZE) {
        QSPI_ProgramPage(QSPI_SELFTEST_ADDR + i, &tx[i], QSPI_PAGE_SIZE);
    }
    write_cycles = DWT->CYCCNT - t0;

    t0 = DWT->CYCCNT;
    QSPI_ReadData(QSPI_SELFTEST_ADDR, rx, QSPI_SELFTEST_SIZE);
    read_cycles = DWT->CYCCNT - t0;

    t0 = DWT->CYCCNT;
    QSPI_EnableMemoryMappedRead(dummy_cycles);
    for (i = 0; i < QSPI_SELFTEST_SIZE; i++) {
        rx[i] = *(__IO uint8_t *)(0x90000000U + QSPI_SELFTEST_ADDR + i);
    }
    mm_read_cycles = DWT->CYCCNT - t0;
    QSPI_DisableMemoryMappedRead();

    if (memcmp(tx, rx, QSPI_SELFTEST_SIZE) != 0) {
        APP_LOGI("QSPI", "selftest FAIL: MM verify mismatch");
        for (i = 0; i < QSPI_SELFTEST_SIZE; i++) {
            if (tx[i] != rx[i]) {
                APP_LOGI("QSPI", "mismatch @+0x%04lx exp=0x%02x got=0x%02x",
                         (unsigned long)i,
                         (unsigned)tx[i],
                         (unsigned)rx[i]);
                break;
            }
        }
        return 0;
    }

    APP_LOGI("QSPI", "selftest PASS erase=%lu cyc write=%lu cyc read=%lu cyc",
             (unsigned long)erase_cycles,
             (unsigned long)write_cycles,
             (unsigned long)read_cycles);
    *write_mbs_x100 = QSPI_MBs_x100(QSPI_SELFTEST_SIZE, write_cycles);
    *read_mbs_x100 = QSPI_MBs_x100(QSPI_SELFTEST_SIZE, mm_read_cycles);

    APP_LOGI("QSPI", "selftest BW write=%lu.%02lu MB/s read(indirect)=%lu.%02lu MB/s read(mm)=%lu.%02lu MB/s",
             (unsigned long)(*write_mbs_x100 / 100U),
             (unsigned long)(*write_mbs_x100 % 100U),
             (unsigned long)(QSPI_MBs_x100(QSPI_SELFTEST_SIZE, read_cycles) / 100U),
             (unsigned long)(QSPI_MBs_x100(QSPI_SELFTEST_SIZE, read_cycles) % 100U),
             (unsigned long)(*read_mbs_x100 / 100U),
             (unsigned long)(*read_mbs_x100 % 100U));
    return 1;
}

static int QSPI_VerifyMemoryMappedRead(uint8_t dummy_cycles)
{
    volatile uint32_t w0, w1, w2, w3;
    
    QSPI_EnableMemoryMappedRead(dummy_cycles);
    __DSB();
    __ISB();
    
    w0 = *(volatile uint32_t *)(0x90000000U);
    w1 = *(volatile uint32_t *)(0x90000004U);
    w2 = *(volatile uint32_t *)(0x90000008U);
    w3 = *(volatile uint32_t *)(0x9000000CU);
    
    QSPI_DisableMemoryMappedRead();
    
    APP_LOGI("QSPI", "mm_verify words: 0x%08lx 0x%08lx 0x%08lx 0x%08lx",
             (unsigned long)w0,
             (unsigned long)w1,
             (unsigned long)w2,
             (unsigned long)w3);
    
    return 1;
}

static int QSPI_RunSelfTestForMs(uint8_t dummy_cycles, uint32_t duration_ms, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100)
{
    uint32_t start = DWT->CYCCNT;
    uint32_t target_cycles = (QSPI_CyclesPerSecond() / 1000U) * duration_ms;
    uint32_t loops = 0U;
    uint32_t write_bw = 0U;
    uint32_t read_bw = 0U;

    if (target_cycles == 0U) {
        target_cycles = 1U;
    }

    do {
        loops++;
        if (!QSPI_RunSelfTestAtCurrentSpeed(dummy_cycles, &write_bw, &read_bw)) {
            APP_LOGI("QSPI", "soak FAIL loop=%lu", (unsigned long)loops);
            return 0;
        }
        APP_LOGI("QSPI", "soak loop=%lu write=%lu.%02lu read=%lu.%02lu MB/s",
                 (unsigned long)loops,
                 (unsigned long)(write_bw / 100U),
                 (unsigned long)(write_bw % 100U),
                 (unsigned long)(read_bw / 100U),
                 (unsigned long)(read_bw % 100U));
    } while ((DWT->CYCCNT - start) < target_cycles);

    *write_mbs_x100 = write_bw;
    *read_mbs_x100 = read_bw;
    APP_LOGI("QSPI", "soak PASS duration=%lums loops=%lu",
             (unsigned long)duration_ms,
             (unsigned long)loops);
    return 1;
}

static uint32_t QSPI_BenchmarkMmRead_x100(uint32_t size_bytes, uint32_t passes)
{
    volatile uint32_t *p32 = (volatile uint32_t *)0x90000000U;
    uint32_t words = size_bytes / 4U;
    uint32_t p;
    uint32_t i;
    uint32_t t0;
    uint32_t cycles;
    volatile uint32_t sink = 0U;

    if (words == 0U || passes == 0U) {
        return 0U;
    }

    __DSB();
    __ISB();
    t0 = DWT->CYCCNT;
    for (p = 0U; p < passes; p++) {
        for (i = 0U; i < words; i++) {
            sink ^= p32[i];
        }
    }
    cycles = DWT->CYCCNT - t0;
    APP_LOGI("QBENCH", "mm-read checksum=0x%08lx size=%lu passes=%lu cycles=%lu",
             (unsigned long)sink,
             (unsigned long)size_bytes,
             (unsigned long)passes,
             (unsigned long)cycles);

