awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
    return QSPI_MBs_x100(size_bytes * passes, cycles);
}

static QSPI_TuneConfig __attribute__((unused)) QSPI_FindFastestStableConfig(void)
{
    static const uint8_t prescalers[] = {1U, 2U, 3U, 4U, 5U};
    static const uint32_t sample_modes[] = {
        QSPI_SAMPLE_SHIFTING_HALFCYCLE,
        QSPI_SAMPLE_SHIFTING_NONE
    };
    static const uint32_t cs_times[] = {
        QSPI_CS_HIGH_TIME_6_CYCLE,
        QSPI_CS_HIGH_TIME_3_CYCLE,
        QSPI_CS_HIGH_TIME_2_CYCLE
    };
    static const uint8_t dummy_cycles[] = {10U, 8U, 6U};

    uint32_t pi;
    uint32_t si;
    uint32_t ci;
    uint32_t di;
    uint32_t write_bw = 0U;
    uint32_t read_bw = 0U;
    QSPI_TuneConfig cfg;

    for (pi = 0U; pi < (sizeof(prescalers) / sizeof(prescalers[0])); pi++) {
        cfg.prescaler = prescalers[pi];

        for (si = 0U; si < (sizeof(sample_modes) / sizeof(sample_modes[0])); si++) {
            cfg.sample_shifting = sample_modes[si];

            for (ci = 0U; ci < (sizeof(cs_times) / sizeof(cs_times[0])); ci++) {
                cfg.cs_high_time = cs_times[ci];

                for (di = 0U; di < (sizeof(dummy_cycles) / sizeof(dummy_cycles[0])); di++) {
                    cfg.dummy_cycles = dummy_cycles[di];

                    APP_LOGI("QSPI", "probe cfg p=%lu %luMHz sample=%s cs=%lu dummy=%lu",
                             (unsigned long)cfg.prescaler,
                             (unsigned long)QSPI_FreqMHz(cfg.prescaler),
                             (cfg.sample_shifting == QSPI_SAMPLE_SHIFTING_HALFCYCLE) ? "half" : "none",
                             (unsigned long)cfg.cs_high_time,
                             (unsigned long)cfg.dummy_cycles);

                    QSPI_InitPeripheral(&cfg);
                    QSPI_LogRegs("after HAL_QSPI_Init");

                    if (!QSPI_ConfigFlashForMemoryMapped(&cfg)) {
                        APP_LOGI("QSPI", "probe FAIL (flash cfg)");
                        continue;
                    }

                    QSPI_LogRegs("post-dummycfg");
                    
                    if (!QSPI_VerifyMemoryMappedRead(cfg.dummy_cycles)) {
                        APP_LOGI("QSPI", "probe FAIL (mm verify)");
                        continue;
                    }
                    
                    if (QSPI_RunSelfTestForMs(cfg.dummy_cycles, QSPI_SOAK_TEST_MS, &write_bw, &read_bw)) {
                        APP_LOGI("QSPI", "probe PASS p=%lu %luMHz sample=%s cs=%lu dummy=%lu write=%lu.%02lu read=%lu.%02lu MB/s",
                                 (unsigned long)cfg.prescaler,
                                 (unsigned long)QSPI_FreqMHz(cfg.prescaler),
                                 (cfg.sample_shifting == QSPI_SAMPLE_SHIFTING_HALFCYCLE) ? "half" : "none",
                                 (unsigned long)cfg.cs_high_time,
                                 (unsigned long)cfg.dummy_cycles,
                                 (unsigned long)(write_bw / 100U),
                                 (unsigned long)(write_bw % 100U),
                                 (unsigned long)(read_bw / 100U),
                                 (unsigned long)(read_bw % 100U));
                        return cfg;
                    }

                    APP_LOGI("QSPI", "probe FAIL p=%lu %luMHz sample=%s cs=%lu dummy=%lu",
                             (unsigned long)cfg.prescaler,
                             (unsigned long)QSPI_FreqMHz(cfg.prescaler),
                             (cfg.sample_shifting == QSPI_SAMPLE_SHIFTING_HALFCYCLE) ? "half" : "none",
                             (unsigned long)cfg.cs_high_time,
                             (unsigned long)cfg.dummy_cycles);
                }
            }
        }
    }

    APP_LOGI("QSPI", "probe FAILED all matrix candidates");
    Error_Handler();
    cfg.prescaler = QSPI_CLOCK_PRESCALER;
    cfg.sample_shifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;
    cfg.cs_high_time = QSPI_CS_HIGH_TIME_3_CYCLE;
    cfg.dummy_cycles = MT25_DUMMY_CYCLES;
    return cfg;
}

/**
 * QSPI_WriteEnable — Send write enable command, poll status for WEL bit
 */
static void QSPI_WriteEnable(void)
{
    QSPI_CommandTypeDef     cmd = {0};
    QSPI_AutoPollingTypeDef cfg = {0};
    uint32_t status_mask;
    uint32_t status_match;
    uint32_t status_bytes;

    /* Send WRITE_ENABLE (0x06) */
    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_WRITE_ENABLE_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_NONE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

    /* In dual mode, poll both status bytes like ST QSPI_MemoryMappedDual example. */
    if (hqspi.Init.DualFlash == QSPI_DUALFLASH_ENABLE) {
        status_mask = 0x0202U;
        status_match = 0x0202U;
        status_bytes = 2U;
    } else {
        status_mask = 0x02U;
        status_match = 0x02U;
        status_bytes = 1U;
    }

    cfg.Match           = status_match;
    cfg.Mask            = status_mask;
    cfg.MatchMode       = QSPI_MATCH_MODE_AND;
    cfg.StatusBytesSize = status_bytes;
    cfg.Interval        = 0x10U;
    cfg.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

    cmd.Instruction     = MT25_READ_STATUS_CMD;
    cmd.DataMode        = QSPI_DATA_1_LINE;

    if (HAL_QSPI_AutoPolling(&hqspi, &cmd, &cfg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

/**
 * QSPI_WaitReady — Poll status register until WIP bit clears (memory ready)
 */
static void QSPI_WaitReady(void)
{
    QSPI_CommandTypeDef     cmd = {0};
    QSPI_AutoPollingTypeDef cfg = {0};
    uint32_t status_mask;
    uint32_t status_bytes;

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_READ_STATUS_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    /* In dual mode, wait for both flashes ready like ST QSPI_MemoryMappedDual example. */
    if (hqspi.Init.DualFlash == QSPI_DUALFLASH_ENABLE) {
        status_mask = 0x0101U;
        status_bytes = 2U;
    } else {
        status_mask = 0x01U;
        status_bytes = 1U;
    }

    cfg.Match           = 0x00U;  /* WIP bit 0 = 0 when ready */
    cfg.Mask            = status_mask;
    cfg.MatchMode       = QSPI_MATCH_MODE_AND;
    cfg.StatusBytesSize = status_bytes;
    cfg.Interval        = 0x10U;
    cfg.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

